{
  "id": 1,
  "title": "إعداد React Router على Hostinger",
  "image": "hostinger.jpg",
  "excerpt": "تعرف على كيفية تكوين ونشر تطبيق React باستخدام React Router على Hostinger بطريقة بسيطة وفعالة.",
  "content": "<p>عند نشر تطبيق React باستخدام React Router على Hostinger، من الشائع مواجهة مشاكل في التنقل. تنشأ هذه المشاكل غالبًا بسبب عدم وجود تكوين صحيح للخادم للتعامل مع التوجيه على الجانب العميل. يوضح هذا الدليل الخطوات اللازمة لإعداد ناجح.</p><h3>الخطوة الأولى: إنشاء ملف .htaccess</h3><p>للتأكد من أن الخادم يعيد توجيه جميع الطلبات بشكل صحيح إلى <code>index.html</code>، قم بإنشاء ملف باسم <strong>.htaccess</strong> داخل مجلد <strong>public</strong> الخاص بمشروع React الخاص بك. أضف الكود التالي إلى هذا الملف:</p><pre><code>&lt;IfModule mod_rewrite.c&gt;\n  RewriteEngine On\n  RewriteBase /\n  RewriteRule ^index\\.html$ - [L]\n  RewriteCond %{REQUEST_FILENAME} !-f\n  RewriteCond %{REQUEST_FILENAME} !-d\n  RewriteCond %{REQUEST_FILENAME} !-l\n  RewriteRule . /index.html [L]\n&lt;/IfModule&gt;</code></pre><p>يضمن هذا الملف أن يتم إعادة توجيه جميع الطلبات غير المرتبطة بالملفات أو المجلدات الموجودة إلى <code>index.html</code>، وهو أمر ضروري لـ React Router.</p><h3>الخطوة الثانية: بناء التطبيق</h3><p>بعد إعداد ملف <code>.htaccess</code>، قم ببناء التطبيق في وضع الإنتاج باستخدام إحدى الأوامر التالية:</p><ul><li><code>npm run build</code></li><li><code>yarn build</code></li></ul><p>سيقوم ذلك بإنشاء مجلد <strong>build</strong> يحتوي على نسخة محسنة من تطبيقك جاهزة للنشر.</p><h3>الخطوة الثالثة: النشر على Hostinger</h3><p>سجل الدخول إلى حساب استضافة Hostinger الخاص بك وقم بتحميل محتويات مجلد <strong>build</strong> إلى الدليل الرئيسي لموقعك الإلكتروني أو إلى نطاق فرعي حسب الحاجة. بمجرد اكتمال هذه العملية، سيكون تطبيقك متاحًا على الإنترنت، وسيعمل التنقل باستخدام React Router بسلاسة.</p><h3>الخاتمة</h3><p>باتباع هذه الخطوات، تضمن أن تطبيق React الخاص بك، بما في ذلك ميزات التنقل، يعمل بسلاسة على Hostinger. هذه الطريقة ليست فعالة فحسب، بل إنها أيضًا بسيطة التنفيذ، حتى بالنسبة للمشاريع المعقدة.</p><h4>شارك نجاحاتك واستمر في التعلم!</h4>"
}
