{
  "id": 1,
  "title": "Configurer React Router sur Hostinger",
  "image": "hostinger.jpg",
  "excerpt": "Apprenez à configurer et déployer une application React utilisant React Router sur Hostinger grâce à une méthode simple et efficace.",
  "content": "<p>Lors du déploiement d'une application React utilisant React Router sur Hostinger, il est courant de rencontrer des problèmes de navigation. Ces problèmes proviennent souvent de l'absence de configuration côté serveur pour gérer les routes client. Ce guide détaille les étapes nécessaires pour une configuration réussie.</p><h3>Étape 1 : Création d'un fichier .htaccess</h3><p>Pour que votre serveur redirige correctement toutes les requêtes vers <code>index.html</code>, créez un fichier nommé <strong>.htaccess</strong> dans le dossier <strong>public</strong> de votre projet React. Ajoutez le code suivant dans ce fichier :</p><pre><code>&lt;IfModule mod_rewrite.c&gt;\n  RewriteEngine On\n  RewriteBase /\n  RewriteRule ^index\\.html$ - [L]\n  RewriteCond %{REQUEST_FILENAME} !-f\n  RewriteCond %{REQUEST_FILENAME} !-d\n  RewriteCond %{REQUEST_FILENAME} !-l\n  RewriteRule . /index.html [L]\n&lt;/IfModule&gt;</code></pre><p>Ce fichier garantit que toutes les requêtes non associées à des fichiers ou dossiers existants seront redirigées vers <code>index.html</code>, ce qui est essentiel pour React Router.</p><h3>Étape 2 : Compilation de l'application</h3><p>Une fois votre fichier <code>.htaccess</code> prêt, compilez votre application en mode production en utilisant l'une des commandes suivantes :</p><ul><li><code>npm run build</code></li><li><code>yarn build</code></li></ul><p>Cela génère un dossier <strong>build</strong> contenant une version optimisée de votre application prête pour le déploiement.</p><h3>Étape 3 : Déploiement sur Hostinger</h3><p>Connectez-vous à votre hébergement Hostinger et téléchargez le contenu du dossier <strong>build</strong> dans le répertoire racine de votre site web ou dans un sous-domaine, selon vos besoins. Une fois cette opération terminée, votre application sera en ligne, et la navigation via React Router fonctionnera parfaitement.</p><h3>Conclusion</h3><p>En suivant ces étapes, vous vous assurez que votre application React, avec ses fonctionnalités de navigation, fonctionne sans problème sur Hostinger. Cette méthode est non seulement efficace mais aussi simple à mettre en œuvre, même pour les projets complexes.</p><h4>Partagez vos réussites et continuez à apprendre !</h4>"
}
