{
  "title": "Imene Yahiaoui Ikhlef ",
  "description": "الموقع الشخصي لمطوة ويب متخصصة في تطوير الواجهة الأمامية مع مهارات في تطوير الواجهة الخلفية و تطوير برامج الهاتف",
  "photo_alt": "إيمان يحياوي إخلف",
  "logo_alt": "لوغو الموقع الشخصي ",
  "home_title": "الصفحة الرئيسية",
  "home_id": "الصفحةالرئيسية",
  "home_path": "/#الصفحةالرئيسية",
  "skills_title": "المهارات",
  "skills_id": "المهارات",
  "skills_path": "/#المهارات",
  "aboutMe": "معلومات عني",
  "aboutMe_path": "/AboutMe",
  "portfolio_title": "معرض الأعمال",
  "portfolio_id": "معرضالأعمال",
  "portfolio_path": "/#معرضالأعمال",
  "contact_title": "تواصل معنا",
  "contact_id": "تواصلمعنا",
  "contact_path": "/#تواصلمعنا",
  "footer": " جميع الحقوق محفوظة© 2023  إيمان يحياوي إخلف",
  "main_heading": {
    "hello": "مرحبا  ",
    "name": " أنا إيمــــان",
    "static_desc": " أنا مطورة ويب",
    "dynamic_desc": " متخصصة في تطوير الواجهة الأمامية"
  },
  "description_info": {
    "main": " أنا مطورة JavaScript متخصصة في React ⚛، ومتمكنة في تقنيات MERN Stack (MongoDB, Express.js, React.js, Node.js) وكذلك في تحسين محركات البحث (SEO)، واختبارات الوحدة، والتكامل، والاختبارات الواجهة  باستخدام Cypress.\n يعكس مساري شغفي اللامتناهي والتزامي المستمر بتحسين مهاراتي ، دائماً متحمسة لتعلم أشياء جديدة ومواجهة التحديات في مجال التطوير، أنا مستعدة للمساهمة بشكل كبير في المشاريع المبتكرة بفضل مسيرتي المهنية المتطورة ومؤهلاتي المتنامية.\n أبقى على اطلاع دائم بأحدث الاتجاهات والممارسات في الصناعة لتقديم حلول تكنولوجية متقدمة.",

    "introduction": "أنا إيمان، مُدمجة ويب ومطوّرة متحمسة لعالم تطوير الويب. كمتعلّمة ذاتية، أتعلم باستمرار تقنيات ونهجًا جديدة لتحسين مهاراتي وتقديم تجارب مستخدم فريدة. حاصلة على شهادة في تكامل الويب   ، وقد عملت على العديد من المشاريع الشخصية لتعزيز مهاراتي كمُدمجة ويب ومطوّرة هدفي هو الاستمرار في التعلّم والتطور كمحترفة في مجال تطوير الويب، مع تقديم حلول إبداعية ومبتكرة لأي مشروع ويب كمُدمجة ويب، اكتسبت خبرة قوية في تطوير مواقع ويب حديثة ووظيفية باستخدام أحدث التقنيات في مجال تطوير الويب. أنا أيضًا متحمسة لتصميم واجهات مستخدم جذابة وبديهية لتقديم تجارب مستخدم مثالية. أنا حاليًا أبحث عن وظيفة بدوام كامل أو بدوام جزئي، وأنا منفتحة لأي فرص جديدة "
  },

  "Download": "تحميل سيرتي الذاتية",
  "all": "الكل",
  "software": "البرامج",
  "Mobile": "الموبايل",
  "Technologies_used": "التكنلوجيا المستعملة",
  "Readmore": "إقرأ المزيد",
  "Send": "إرسال",
  "Name": "الإسم",
  "Email": "البريد الإلكتروني",
  "Message": "الرسالة",
  "Demo": "عرض",
  "source_code": "الكود المصدري",
  "email_envoyer": "تم إرسال بريدك الإلكتروني بنجاح. سأقوم بالرد عليكم في أقرب وقت ممكن",
  "notFound": {
    "message__title": "صفحة غير متاحة",
    "message__text": " نعتذر، الصفحة المطلوبة غير موجودة .",
    "message__btn": "العودة للصفحة الرئيسية"
  },
  "projectBooki": {
    "brief_description": " موقع يسمح لك بحجز فندق في اي مكان تريده و الإطلاع على الانشطة  الموجودة في ذلك المكان   ",
    "description_project": " بوكي  هو أول مشروع تطوير ويب عملت عليه في تدريب تكامل الويب  قمت بإنشاء موقع اعتمادا  على تصميم معد ، بدأت بتحليل التصميم تم تطبيقه. اتبعت أفضل ممارسات تطوير الويب واحترمت المعايير الجودة المعتمدة.كما تأكدت من أن الموقع الويب يكون متكيفًا، أي أنه يتكيف تلقائيًا مع أنواع وأحجام شاشات مختلفة "
  },
  "projectOhMyFood": {
    "brief_description": "موقع إلكتروني للمطاعم الفاخرة. يستطيع العملاء  تركيب قائمة الطعام الخاصة بهم قبل وصولهم حتى تكون الأطباق جاهزة حسب تفضيلاتهم",
    "description_project": " هو موقع ويب يستهدف الهواتف المحمولة، يقدم قوائم المطاعم الفاخرة. تمثلت مهمتي كمطورة ويب في هذا المشروع تحويل النماذج التي قدمها فريق التصميم إلى موقع ويب يعمل بشكل فعال ويتكيف مع الأجهزة المختلفة مثل الهواتف الذكية والأجهزة اللوحية وأجهزة الكمبيوتر المكتبية.\n وفي إطار هذا المشروع، كان علي تضمين الرسوم المتحركة والتصرفات المحددة في نموذج الموقع لتوفير تجربة مستخدم ممتازة وجذابة. هذه التجربة المهنية قدمت لي الفرصة لتطبيق مهاراتي في تكامل الويب وتقديم نتائج عالية الجودة في المواعيد المحددة"
  },
  "projectPortfolioArchitecte": {
    "brief_description": "موقع شخصي لمهندسة ديكور داخلي ، يسمح لها بعرض أعمالها بشكل متناسق ",
    "description_project": "بصفتي مُدمجة ويب، عملت على تطوير موقع لعرض أعمال مهندسة داخلية.\n كانت مهمتي تصميم الجزء الأمامي من الموقع، وتمكنت بفضل مهاراتي في جافا سكريبت من استرداد أعمال المهندسة من واجهة برمجة التطبيقات ودمجها في معرض الصور بطريقة ديناميكية. كما قمت بتصميم صفحة تسجيل الدخول الآمنة للسماح للمستخدمين بالوصول إلى واجهة الإدارة للموقع.\n وقمت بتطبيق ميزات تسمح للمستخدمين المسجلين بحذف أو إضافة أعمال دون الحاجة إلى إعادة تحميل الصفحة. عملي أدى إلى تحسين تجربة المستخدم وجعل الموقع أكثر تفاعلية. "
  },
  "projectKasa": {
    "brief_description": " تطبيق مخصص لتأجير الشقق بمختلف انواعها بين الأفراد في فرنسا",
    "description_project": "تطبيق رائد في تأجير الشقق في فرنسا.\n  مهمتي كانت تجديد الموقع بإستخدام جافا سكريبت لجانب العميل  استعنت برياكت للعمل على الواجهة الأمامية ، كما كان لدي ملف جسون يحتوي على معلومات الشقق قمت بربطه مع الواجهة الأمامية ، كما استعنت بنموذج التصميم على منصة فيقما لانشاء موقع وظيفي و متكيف مع الأجهزة المختلفة مثل الهواتف الذكية والأجهزة اللوحية وأجهزة الكمبيوتر المكتبية."
  },
  "projectNinaCarducci": {
    "brief_description": " موقع ويب لنينا كاردوتشي، مصورة محترفة، بهدف عرض أعمالها وخدماتها",
    "description_project": "هذا المشروع يتضمن مقترح لخدمات تحسين محركات البحث  لنينا كاردوتشي، مصورة فوتوغرافية.\n  عملت على تحسين أداء تحسين محركات البحث المحلي، وإضافة البيانات الوصفية لوسائل التواصل الاجتماعي، وتحسين الموقع من حيث الكود والهيكلية، بالإضافة إلى تحسين الصور والموقع بشكل عام. كتبت تقريرًا عن التحسين وقدمت الكود المحسن. هدفي كان تحسين تحسين محركات البحث  للموقع لتحسين الرؤية عبر الإنترنت"
  },
  "projectArgentBankWebsite": {
    "brief_description": "هو بنك إلكتروني جديد يسعى إلى توفير لوحة تحكم سهلة الاستخدام لمستخدميه",
    "description_project": "  بنك آرجنت هو بنك إلكتروني جديد يسعى إلى توفير لوحة تحكم سهلة الاستخدام لمستخدميه.\n  لتحقيق هذا الهدف،الردوكس. أيضا قمت بإنشاء ملف يحتوي على اقتراحات   قمت بتطوير تطبيق ويب متكامل، مستجيب ويتوافق مع الموبايل باستخدام رياكت و خصائصا من رياكت روت و   وحماية الروت  . تتضمن ميزات التطبيق مصادقة المستخدم، الصفحة الرئيسية و ادارة المعلومات"
  },
  "projectHebergeMoi": {
    "brief_description": "تطبيق لتأجير الشقق يسمح للعميل بالاطلاع على صور الشقة و سعرها و مكان تواجدها",
    "description_project": "هو تطبيق لتأجير الشقق يسمح للعميل بالاطلاع على صور الشقة و سعرها و مكان تواجدها . \n التطبيق مبني بلغة الجافا سكريبت استعملت الرياكت كإطار للواجهة الامامية و نود و مونعو د.ب   من جهة السيرفر. "
  },
  "projectWorkVibes": {
    "brief_description": "شبكة اجتماعية مصممة لتعزيز التعاون والتواصل بين أعضاء الشركة",
    "description_project": "WorkVibes هو شبكة اجتماعية مصممة لتعزيز التعاون والتواصل داخل الفرق داخل الشركة \n  إنها تقدم أكثر بكثير من مجرد شبكة اجتماعية للشركة؛ إنها منصة ديناميكية حيث يمكن للمستخدمين مشاركة الأفكار والمشاريع، وحتى مشروباتهم المفضلة في الصباح"
  },
  "Educations": {
    "Educations": "التعليم",
    "DéveloppeurApplication": {
      "title": "مطور تطبيقات - جافا سكريبت رياكت",
      "Diplôme": "شهادة مستوى 6 (البكالوريوس + 3/4)",
      "localisation": "Openclassrooms | باريس"
    },
    "Intégrateur": {
      "title": "مطور  ويب",
      "Diplôme": "شهادة مستوى 5 (الدبلوم الجامعي)",
      "localisation": "Openclassrooms | باريس"
    },
    "sciencePo": {
      "title": "ماستر في العلوم السياسية و العلاقات الدولية",
      "Diplôme": "شهادة مستوى 7 (درجة الماجستير)",
      "localisation": "جامعة الجزائر 3 | الجزائر"
    }
  },
  "Experiences": {
    "Experiences": "الخبرة المهنية",

    "Assistante": {
      "Present": "حتى الأن",
      "title": "مساعدة مدير",
      "localisation": " BFT Services | ضواحي باريس",
      "description": "إدارة الاستقبال وصياغة وإرسال البريد الإلكتروني، بالإضافة إلى تنسيق وإدارة المهام الإدارية"
    },
    "Enseignante": {
      "title": "متطوعة - معلمة",
      "localisation": "المدرسة الليبية إبن خلدون | باريس",
      "description": "تدريس وحدة الحاسوب للفصول الإعدادية والثانوية"
    },
    "Journaliste": {
      "title": "صحفية",
      "localisation": "جريدة الشاهد | الجزائر",
      "description": "تابة مقالات وتقارير صحفية حول الأحداث الجارية"
    }
  }
}
