{
  "title": "Imene Yahiaoui Ikhlef ",
  "description": "portfolio Imene Yahiaoui IkhlefFront-end and Fullstack web developer.in Ile De France",
  "logo_alt": "logo portfolio",
  "home_title": "Home",
  "home_path": "/",
  "skills_title": "Skills",
  "skills_path": "/#Skills",
  "portfolio_title": "Portfolio",
  "portfolio_path": "/#portfolio",
  "contact_title": "Contact",
  "contact_path": "/#contact",

  "main_heading": {
    "hello": "Hello 👋",
    "name": "I'm Imene",
    "static_desc": "I'am a Front-End developer",
    "dynamic_desc": "Passionate about the world of web development."
  },
  "description_info": {
    "main": "I am a self-taught individual who is constantly learning new technologies and approaches to improve my skills and provide unique user experiences. In addition, I hold a degree in web integration at the Bac+2 level. My passion for back-end development also drives me to explore technologies such as Node.js and MongoDB to expand my skills and create innovative web applications",
    "introduction":"My name is Imene and I am a web integrator and front-end developer passionate about the world of web development. As a self-taught individual, I am constantly learning new technologies and approaches to improve my skills and provide unique user experiences. I hold a degree in web integration at the Bac+2 level. I have worked on several personal projects to strengthen my skills as a web integrator and front-end developer. My goal is to continue learning and evolving as a web professional while offering creative and innovative solutions for any web project.As a web integrator, I have gained strong expertise in developing modern and functional websites using the latest web development technologies. I am also passionate about designing attractive and intuitive user interfaces to provide optimal user experiences. Currently looking for a position in permanent or temporary employment, I am open to new opportunities to continue developing my skills and contribute to the field of web development."
  },
  "Download": "Download my CV",
  "all": "All",
  "Technologies_used": "Technologies used",

  "projectBooki": {
    "brief_description": "Booki is the first web development project on which I worked during my training as a web integrator at OpenClassrooms.\n My role was to integrate the mockups provided by the UI design team and transform them into a functional web interface using HTML and CSS",
    "description_project": "Booki is the first web development project on which I worked during my training as a web integrator at OpenClassrooms.\n My role was to integrate the mockups provided by the UI design team and transform them into a functional web interface using HTML and CSS. The project started with the analysis of mockups, provided in the form of Figma files for different screen sizes.\n Following the best practices of web development and adhering to established quality standards, I worked on integrating the mockups using HTML and CSS.\n I also ensured that the website was responsive, meaning that it automatically adapts to different screen types and sizes."
  },

  "notFound": {
    "message__title": "Page Not Found",
    "message__text": " We're sorry, the page you were looking for isn't found here.",
    "message__btn": "Return to the home page"
  }
}
