{
  "title": "Imene Yahiaoui Ikhlef ",
  "description": "portfolio Imene Yahiaoui IkhlefFront-end and Fullstack web developer.in Ile De France",
  "photo_alt": "Imene Yahiaoui Ikhlef",
  "logo_alt": "Portfolio logo",
  "home_title": "Home",
  "home_id": "Home",
  "home_path": "/#Home",
  "skills_title": "Skills",
  "skills_id": "Skills",
  "skills_path": "/#Skills",
  "solotion_title": "Solutions",
  "solotion_id": "solotion",
  "solotion_path": "/solotion",
  "aboutMe": "About Me",
  "aboutMe_path": "/AboutMe",
  "portfolio_title": "Portfolio",
  "portfolio_id": "Portfolio",
  "portfolio_path": "/#Portfolio",
  "contact_title": "Contact",
  "contact_id": "Contact",
  "contact_path": "/#Contact",
  "footer": "Copyright © 2024 - Imene Yahiaoui Ikhlef  ",
  "cookie": "Cookie Policy",
  "main_heading": {
    "hello": "Hello ",
    "name": "I'm Imene",
    "static_desc": "JavaScript Developer ",
    "dynamic_desc": "Specialized in React"
  },
  "description_info": {
    "main": "I am a JavaScript developer specializing in React ⚛, proficient in the MERN Stack (MongoDB, Express.js, React.js, Node.js) as well as in SEO, unit testing, integration, and end-to-end testing with Cypress.\n My journey reflects my insatiable curiosity and constant commitment to improving my skills.\nAlways eager to learn new things and tackle challenges in the development field, I am ready to make significant contributions to innovative projects thanks to my evolving professional background and qualifications.\n I stay informed about the latest trends and practices in the industry to provide cutting-edge technological solutions.",

    "introduction": "My name is Imene and I am a full stack developer passionate about the world of web development. As a self-taught individual, I am constantly learning new technologies and approaches to improve my skills and provide unique user experiences. I hold a degree in web integration at the Bac+2 level. I have worked on several personal projects to strengthen my skills as a web integrator and front-end developer. My goal is to continue learning and evolving as a web professional while offering creative and innovative solutions for any web project.As a web integrator, I have gained strong expertise in developing modern and functional websites using the latest web development technologies. I am also passionate about designing attractive and intuitive user interfaces to provide optimal user experiences. Currently looking for a position in permanent or temporary employment, I am open to new opportunities to continue developing my skills and contribute to the field of web development."
  },
  "Download": "Download my CV",
  "all": "All",
  "software": "Software",
  "Mobile": "Mobile",
  "Technologies_used": "Technologies used",
  "Readmore": "Read more",
  "Send": "Submit",
  "Name": "Name",
  "Email": "Email",
  "Message": "Message",
  "Demo": "Demo",
  "source_code": "Source code",
  "email_envoyer": "Your email has been successfully sent. I will get back to you as soon as possible",
  "notFound": {
    "message__title": "Page Not Found",
    "message__text": " We're sorry, the page you were looking for isn't found here.",
    "message__btn": "Return to the home page"
  },

  "projectBooki": {
    "brief_description": "This is a website that offers the opportunity to book a hotel while allowing users to explore the various activities available in the region.",
    "description_project": "Booki is my very first web development project that I worked on during my training as a web integrator at OpenClassrooms.\n  My main role was to take the mockups provided by the UI design team and turn them into a functional web interface using HTML and CSS.\n The project started with a careful analysis of the mockups, which were available as Figma files for different screen sizes. Following best practices in web development and adhering to established quality standards, I worked on integrating the mockups using HTML and CSS. I also ensured that the website was fully responsive, meaning it could automatically adapt to different types and sizes of screens."
  },
  "projectOhMyFood": {
    "brief_description": "This is a website dedicated to gourmet restaurants, where customers have the opportunity to create their own menu before their arrival. ",
    "description_project": "OhMyFood is a mobile-first website dedicated to presenting menus offered by gourmet restaurants. As a Front-End developer, my role was to transform the mockups provided by the design team into a functional and responsive website, suitable for various devices such as smartphones, tablets, and desktop computers.\n As part of this project, I was also tasked with integrating the animations and behaviors specified in the site's prototype to provide an optimal and attractive user experience. This professional experience allowed me to put my web integration skills into practice and deliver a quality result within the given timeframe."
  },
  "projectPortfolioArchitecte": {
    "brief_description": "This is a personal website specifically designed for an interior architect, providing a platform to showcase their portfolio in a cohesive and professional manner.",
    "description_project": "As a Front-End developer, I worked on developing the portfolio website of an interior architect.\n My mission consisted of designing the front-end part of the site.\n Using my JavaScript skills, I managed to retrieve the architect's work from the API and integrated them into a dynamic gallery. I also designed a secure login page to allow users to access the site's administration interface.\n I implemented features to allow logged-in users to delete or add works without the need to reload the page.\n My work improved the user experience and made the site more interactive."
  },
  "projectKasa": {
    "brief_description": "Kasa is an application dedicated to peer-to-peer apartment rentals in France",
    "description_project": "As a developer, I was tasked by Kasa, a leading peer-to-peer apartment rental company in France, to renovate their website.\n For this task, I used JavaScript for the client-side and opted for React as the front-end framework. I had access to 20 recent real estate listings in JSON format, which I worked on to create a functional and responsive website.\n I also used Figma to convert the designs into React components and routes, ensuring visual consistency while developing an interactive and user-friendly interface."
  },
  "projectNinaCarducci": {
    "brief_description": "Website for Nina Carducci, professional photographer, with the aim of showcasing her portfolio and services",
    "description_project": "The objective of this project was to provide Nina Carducci, a photographer, with SEO optimization services. I worked on various aspects to enhance the local search engine performance of her website.\n  This included adding appropriate metadata for social media to optimize sharing on these platforms. I also made technical optimizations in terms of code and site structure to improve its accessibility to search engines. Special attention was given to optimizing images by reducing their size without compromising quality. Ultimately, my goal was to improve Nina's website SEO to increase online visibility and attract more potential clients.\n  I provided a comprehensive optimization report along with the optimized code to enable Nina to implement the recommendations."
  },
  "projectArgentBankWebsite": {
    "brief_description": "Argent Bank is a new online bank that aims to provide its users with a user-friendly dashboard",
    "description_project": "Argent Bank is a new online bank that aims to provide its users with a user-friendly dashboard. To achieve this goal, I developed a complete web application that is responsive and compatible with all devices using technologies such as React, React Router 6, and Protected Routes. \n The application includes several essential features, including user authentication, a homepage, a login page, a profile page, and application state management with Redux. Additionally, I created a dedicated YAML file for transaction-related features.\n This will allow users to easily view their transactions and add, edit, or delete transaction information. With these developments, Argent Bank users will enjoy a smooth and convenient experience when managing their online financial transactions."
  },
  "projectHebergeMoi": {
    "brief_description": "An apartment rental application that provides customers with the ability to view photos, check prices, and obtain detailed information about the location of various apartments.",
    "description_project": "This is an apartment rental application that allows the client to view apartment photos, prices, and locations.\n The application is built using JavaScript, with React for the frontend and Node.js, Express, and MongoDB for the server side"
  },
  "projectWorkVibes": {
    "brief_description": "a social network designed to foster collaboration and connection among members of a company",
    "description_project": "WorkVibes is a social network designed to foster collaboration and connection within teams within a company.\n It offers much more than just a company social network; it's a dynamic platform where users can share ideas, projects, and even their favorite morning beverages!"
  },
  "Educations": {
    "Educations": "Educations",
    "Formation": {
      "title": "Training in Computer Science and Artificial Intelligence",
      "Diplôme": "",
      "localisation": "EDU Business Institute "
    },
    "DéveloppeurApplication": {
      "title": "Application Developer - JavaScript React",
      "Diplôme": "Bachelor's degree",
      "localisation": "Openclassrooms | Paris"
    },
    "Intégrateur": {
      "title": "Web Integrator",
      "Diplôme": "Associate degree",
      "localisation": "Openclassrooms | Paris"
    },
    "sciencePo": {
      "title": "Master's in Political Science",
      "Diplôme": "Master's degree",
      "localisation": "University of Algiers 3 | Algiers"
    }
  },
  "Experiences": {
    "Experiences": "Experiences",
    "DéveloppeuseFullstack": {
      "Present": "Present",
      "title": "Fullstack Developer",
      "localisation": " Andragogy  | Internship",
      "description": "Assisting in the creation of a statistics interface. Patching a website using the MERN stack"
    },
    "Assistante": {
      "Present": "Present",
      "title": "Assistant Director",
      "localisation": " BFT Services | Ile de France",
      "description": "Managed reception, drafting and forwarding of emails, as well as coordination and administrative task management"
    },
    "Enseignante": {
      "title": "Teacher-Volunteer ",
      "localisation": "Libyan School Iben Khaldoun | Paris",
      "description": "Teaching computer module for preparatory and secondary classes"
    },
    "Journaliste": {
      "title": "Journalist",
      "localisation": "Elshahed Journal | Algiers",
      "description": "Writing articles and journalistic reports on current events"
    }
  },
  "article": {
    "title": "Loading article...",
    "noFound": "No article found",
    "back": "Back",
    "readMore": "Read more",
    "noFounMore": "No related articles found"
  },
  "solution": {
    "pagedes": "Articles per page",
    "nonFound": "No articles found",
    "readMore": "Read the article"
  },

  "cookies": {
    "title": "Cookie Policy",
    "intro1": "We use cookies to ensure its proper functioning, improve your browsing experience, and help us understand how you interact with our content. These cookies are categorized and detailed below. You can adjust your preferences at any time, but please note that certain site functionalities may be impacted if you disable certain types of cookies.",
    "intro2": "Third-party cookies are also used to personalize ads, analyze traffic, or provide additional functionalities. These cookies are only activated with your consent.",
    "types": "Types of Cookies Used",
    "essential": "Essential Cookies",
    "essential_description": "These cookies are essential for the proper functioning of the site. They allow, for example, to keep your session secure or to remember your privacy settings. These cookies do not collect personal data.",
    "functional": "Functional Cookies",
    "functional_description": "Functional cookies make your browsing more enjoyable. For example, they allow you to share content on social networks or use certain third-party services. Some data collected via these cookies may be linked to personal information.",
    "analytics": "Analytics Cookies",
    "analytics_description": "These cookies collect anonymous data about how visitors interact with our site (e.g., pages visited or session duration). This information helps us improve the quality of our content and your user experience.",
    "performance": "Performance Cookies",
    "performance_description": "They measure the technical performance of our site, such as loading time or error detection. This information allows us to improve the reliability and speed of the site.",
    "advertising": "Advertising Cookies",
    "advertising_description": "These cookies personalize ads based on your interests and measure the effectiveness of advertising campaigns. They may also be used to recommend relevant content based on your preferences.",
    "reset_button": "Reset Cookies"
  },
  "cookiesMSG": {
    "title": "We use cookies to enhance your experience. Check our",
    "CookiePolicy": "Cookie Policy",
    "ok": "Accept",
    "no": "Decline"
  }
}
