{
  "title": "Imene Yahiaoui Ikhlef ",
  "description": "portfolio Imene Yahiaoui Ikhlef Développeuse web Front-end et Fullstack.sur Ile De France",
  "photo_alt": "Imene Yahiaoui Ikhlef",
  "logo_alt": "logo de portfolio ",
  "home_title": "Accueil",
  "home_id": "Accueil",
  "home_path": "/#Accueil",
  "skills_title": "Compétences",
  "skills_id": "Compétences",
  "skills_path": "/#Compétences",
  "portfolio_title": "Portfolio",
  "portfolio_id": "Portfolio",
  "portfolio_path": "/#Portfolio",
  "contact_title": "Contact",
  "contact_id": "Contact",
  "contact_path": "/#Contact",

  "main_heading": {
    "hello": "Bonjour",
    "name": " c'est Imene",
    "static_desc": " Je suis  développeuse full stack ",
    "dynamic_desc": "passionnée par le monde du développement web"
  },
  "description_info": {
    "main": "Je suis une personne autodidacte qui apprend constamment de nouvelles technologies et approches pour améliorer mes compétences et offrir des expériences utilisateur uniques.\n De plus, j'ai un diplôme en intégration web au niveau Bac+2. Ma passion pour le développement back-end me pousse également à explorer des technologies telles que Node.js et MongoDB pour élargir mes compétences et créer des applications web innovantes.",
    "introduction": " Je m'appelle Imene, et je suis  développeuse full stack passionnée par le monde du développement web. En tant qu'autodidacte, je suis constamment en train d'apprendre de nouvelles technologies et de nouvelles approches pour améliorer mes compétences et offrir des expériences utilisateur uniques.j'ai un diplôme en intégration web au niveau Bac+2, j'ai travaillé sur plusieurs projets personnels pour renforcer mes compétences en tant qu'intégratrice web et développeuse de Front-end. Mon objectif est de continuer à apprendre et à évoluer en tant que professionnelle du web, tout en offrant des solutions créatives et innovantes pour tout projet web.En tant qu'intégratrice web, j'ai acquis une solide expertise dans le développement de sites web modernes et fonctionnels en utilisant les dernières technologies en matière de développement web. Je suis également passionnée par la conception d'interfaces utilisateur attrayantes et intuitives pour offrir des expériences utilisateur optimales. Actuellement à la recherche d'un poste en CDI ou CDD, je suis ouverte à de nouvelles opportunités pour continuer à développer mes compétences et apporter ma contribution dans le domaine du développement web."
  },
  "Download": "Télécharger mon CV",
  "all": "Tout",
  "software": "Logiciel",
  "Mobile": "Mobile",
  "Technologies_used": "Technologies utilisées",
  "Readmore": "En savoir plus",
  "Send": "Envoyer",
  "Name": "Nom",
  "Email": "Email",
  "Message": "Message",
  "Demo": "Démo",
  "source_code": "Code source",
  "email_envoyer": "Votre e-mail a bien été envoyé. Je reviendrai vers vous dans les plus brefs délais",
  "notFound": {
    "message__title": "Page non trouvée",
    "message__text": " Nous sommes désolés, la page que vous recherchez n'existe pas.",
    "message__btn": "Retourner sur la page d'accueil"
  },
  "projectBooki": {
    "brief_description": "Site web qui permet de réserver un hôtel n'importe où et de découvrir les activités disponibles dans cette région",
    "description_project": "Booki est le premier projet de développement web sur lequel j'ai travaillé dans la formation d'intégrateur web chez OpenClassrooms.\n Mon rôle a été d'intégrer les maquettes fournies par l'équipe de conception UI et de les transformer en une interface web fonctionnelle à l'aide de HTML et CSS.\n Le projet a commencé par l'analyse des maquettes fournies sous forme de fichiers Figma pour différentes tailles d'écran, En suivant les meilleures pratiques de développement web et en respectant les normes de qualité établies.\n j'ai travaillé sur l'intégration des maquettes en HTML et CSS. J'ai également veillé à ce que le site web soit adaptatif, c'est-à-dire qu'il s'adapte automatiquement à différents types et tailles d'écran."
  },
  "projectOhMyFood": {
    "brief_description": "Un site web pour les restaurants gastronomiques. Les clients peuvent composer leur propre menu avant leur arrivée pour que les plats soient prêts à leur convenance",
    "description_project": "OhMyFood est un site web mobile-first dédié à la présentation des menus proposés par les restaurants gastronomiques.\n  Mon rôle en tant qu'intégratrice web était de transformer les maquettes fournies par l'équipe de conception en un site web fonctionnel et responsive, adapté aux différents dispositifs tels que les smartphones, tablettes et ordinateurs de bureau.\n  Dans le cadre de ce projet, j'ai également eu pour mission d'intégrer les animations et comportements spécifiés dans le prototype du site pour offrir une expérience utilisateur optimale et attrayante.\n  Cette expérience professionnelle m'a permis de mettre en pratique mes compétences en matière d'intégration web et de livrer un résultat de qualité dans les délais impartis."
  },
  "projectPortfolioArchitecte": {
    "brief_description": "Un site personnel pour une architecte d'intérieur, qui lui permet de présenter ses réalisations de manière cohérente.",
    "description_project": "En tant qu'intégratrice web, j'ai travaillé sur le développement du site portfolio d'une architecte d'intérieur.\n  Ma mission a consisté à concevoir la partie front-end du site. Grâce à mes compétences en JavaScript, j'ai réussi à récupérer les travaux de l'architecte depuis l'API et les ai intégrés dans une galerie dynamique.\n  J'ai également conçu une page de connexion sécurisée pour permettre aux utilisateurs d'accéder à l'interface d'administration du site.\n  J'ai implémenté des fonctionnalités pour permettre aux utilisateurs connectés de supprimer ou ajouter des travaux sans avoir besoin de recharger la page. Mon travail a permis d'améliorer l'expérience utilisateur et de rendre le site plus interactif. "
  },
  "projectKasa": {
    "brief_description": "Kasa est une application dédiée à la location d'appartements entre particuliers en France",
    "description_project": "Kasa, leader de la location d'appartements entre particuliers en France, m'a confié la mission de rénover leur site en utilisant JavaScript pour le côté client, et j'ai utilisé React comme framework pour le front-end.\n  J'ai eu accès à 20 annonces immobilières récentes au format JSON sur lesquelles j'ai travaillé pour développer un site web fonctionnel et responsive.\n  J'ai également utilisé Figma pour convertir les maquettes en composants et routes React."
  },
  "projectNinaCarducci": {
    "brief_description": "Site web pour Nina Carducci, photographe professionnelle, dans le but de présenter ses réalisations et ses services.",
    "description_project": "Ce projet consiste en une proposition de service d'optimisation SEO à Nina Carducci, une photographe.\n  J'ai travaillé sur l'amélioration des performances de référencement local, l'ajout de métadonnées pour les réseaux sociaux, l'optimisation du site en termes de code et de structure, ainsi que l'optimisation des images et du site dans son ensemble.\n  J'ai rédigé un rapport d'optimisation et fourni le code optimisé  , mon objectif était d'améliorer le référencement du site pour une meilleure visibilité en ligne"
  },
  "projectArgentBankWebsite": {
    "brief_description": "Argent Bank est une nouvelle banque en ligne souhaitant fournir à ses utilisateurs un tableau de bord convivial",
    "description_project": "Argent Bank est une nouvelle banque en ligne souhaitant fournir à ses utilisateurs un tableau de bord convivial. Pour atteindre cet objectif, j'ai développé une application web complète, réactive et responsive en utilisant React, 'React Router 6' et 'Protected Routes'.\n  Les fonctionnalités de l'application incluent l'authentification de l'utilisateur, la page d'accueil, la page de connexion, la page de profil ainsi que la gestion de l'état de l'application avec Redux.\n En outre, j'ai créé un fichier YAML dédié aux fonctionnalités relatives aux transactions. Cela permettra aux utilisateurs de visualiser leurs transactions, d'ajouter, de modifier ou de supprimer des informations liées à une transaction en toute simplicité."
  },
  "projectHebergeMoi": {
    "brief_description": "une application de location d'appartements qui offre aux clients la possibilité de visualiser des photos, le prix et l'emplacement des appartements",
    "description_project": "Il s'agit d'une application de location d'appartements qui offre aux clients la possibilité de visualiser des photos, le prix et l'emplacement des appartements.\n  Cette application a été développée en JavaScript, en utilisant React pour le frontend et Node.js, express et MongoDB pour le côté serveur."
  },
  "projectAsselelmatell": {
    "brief_description": "Application  propose des histoires et des contes de proverbes populaires que de nombreuses personnes continuent de circuler sans connaître leur histoire",
    "description_project": "L'application 'Asselelmatell''Proverbe Origin' propose des histoires et des contes de proverbes populaires que de nombreuses personnes continuent de circuler sans connaître leur histoire, leur origine et leur lieu de départ.\n  Cette application ne nécessite pas de connexion Internet et permet aux utilisateurs de partager facilement des histoires avec leurs amis. \n L'application est disponible gratuitement sur le Play Store et a été téléchargée plus de 500 fois."
  },
  "project36": {
    "brief_description": "un jeu consiste à progresser à travers un tableau de cases numérotées en partant du numéro 1 et en atteignant le numéro 36",
    "description_project": "Le jeu débute à partir du numéro 1 et se poursuit jusqu'à l'atteinte du nombre 36, cependant, des règles simples régissent la   rogression :Le déplacement horizontal ↔ et vertical ↕ correspond à deux cases.Le déplacement en diagonale ⤭⤪ équivaut à une case.\n   Si vous parvenez à un nombre et que toutes les cases de déplacement autorisées sont déjà occupées, vous perdez la partie."
  }
}
