{
  "id": 1,
  "title": "Set Up React Router on Hostinger",
  "image": "hostinger.jpg",
  "excerpt": "Learn how to configure and deploy a React application using React Router on Hostinger with a simple and efficient method.",
  "content": "<p>When deploying a React application using React Router on Hostinger, navigation issues are common. These issues often arise from the lack of proper server configuration to handle client-side routing. This guide details the steps necessary for a successful setup.</p><h3>Step 1: Create an .htaccess File</h3><p>To ensure your server correctly redirects all requests to <code>index.html</code>, create a file named <strong>.htaccess</strong> in the <strong>public</strong> folder of your React project. Add the following code to this file:</p><pre><code>&lt;IfModule mod_rewrite.c&gt;\n  RewriteEngine On\n  RewriteBase /\n  RewriteRule ^index\\.html$ - [L]\n  RewriteCond %{REQUEST_FILENAME} !-f\n  RewriteCond %{REQUEST_FILENAME} !-d\n  RewriteCond %{REQUEST_FILENAME} !-l\n  RewriteRule . /index.html [L]\n&lt;/IfModule&gt;</code></pre><p>This file ensures that all requests not associated with existing files or directories are redirected to <code>index.html</code>, which is essential for React Router.</p><h3>Step 2: Build the Application</h3><p>Once your <code>.htaccess</code> file is ready, build your application in production mode using one of the following commands:</p><ul><li><code>npm run build</code></li><li><code>yarn build</code></li></ul><p>This will generate a <strong>build</strong> folder containing an optimized version of your application ready for deployment.</p><h3>Step 3: Deploy to Hostinger</h3><p>Log in to your Hostinger hosting account and upload the contents of the <strong>build</strong> folder to the root directory of your website or a subdomain as needed. Once this process is complete, your application will be online, and navigation with React Router will work seamlessly.</p><h3>Conclusion</h3><p>By following these steps, you ensure that your React application, complete with its navigation features, functions smoothly on Hostinger. This method is both efficient and simple to implement, even for complex projects.</p><h4>Share your successes and keep learning!</h4>"
}
